{"cells":[{"cell_type":"markdown","metadata":{"id":"M3OL2TEYjFPK"},"source":["## Основы программирования в Python\n","\n","*Алла Тамбовцева, НИУ ВШЭ*\n","\n","## Семинар 3"]},{"cell_type":"markdown","metadata":{"id":"7wCmTKDhjFPS"},"source":["### Задача 1\n","\n","Напишите программу, которая запрашивает у пользователя его фамилию, имя, отчество, введенные в одну строчку через пробел, и выводит на экран сообщения:\n","\n","    Ваша фамилия: фамилия\n","    Ваше имя: имя\n","    Ваше отчество: отчество\n","\n","**Пример:**\n","\n","*Входные данные:*\n","\n","    Введите Ваши ФИО: Тамбовцева Алла Андреевна\n","\n","*Выходные данные:*\n","\n","    Ваша фамилия: Тамбовцева\n","    Ваше имя: Алла\n","    Ваше отчество: Андреевна"]},{"cell_type":"code","source":["a = input('Введите Ваши ФИО: ').split()\n","print('Ваша фамилия:', a[0])\n","print('Ваше имя:', a[1])\n","print('Ваше отчество:', a[2])"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"nU-1Tt0ajJyU","outputId":"15914ebb-004a-47f0-95cc-da36290e6dec","executionInfo":{"status":"ok","timestamp":1640856274707,"user_tz":-180,"elapsed":16167,"user":{"displayName":"Yulya Yulya","photoUrl":"https://lh3.googleusercontent.com/a/default-user=s64","userId":"13298818835018446364"}}},"execution_count":1,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите Ваши ФИО: Лубнина Юлия Алексеевна\n","Ваша фамилия: Лубнина\n","Ваше имя: Юлия\n","Ваше отчество: Алексеевна\n"]}]},{"cell_type":"markdown","metadata":{"id":"w9HwWkg6jFPU"},"source":["### Задача 2\n","\n","Напишите программу, которая берет строку \"1; 2; 3; 100\" и возвращает:\n","\n","* список из целых чисел\n","* список из чисел с плавающей точкой"]},{"cell_type":"code","source":["a = '1; 2; 3; 100'.split(\"; \")\n","a1 = []\n","a2 = []\n","for n in a:\n","    a1.append(int(n))\n","print(a1)\n","for n in a:\n","    a2.append(float(n))\n","print(a2)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"Y1jUYevYk195","outputId":"f2c9f2bf-7282-4a74-c088-a21fec9a602d"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["[1, 2, 3, 100]\n","[1.0, 2.0, 3.0, 100.0]\n"]}]},{"cell_type":"markdown","metadata":{"id":"XjbudSZBjFPW"},"source":["### Задача 3\n","\n","Напишите программу, которая запрашивает у пользователя номер мобильного телефона, введенный через дефис, а возвращает номер, записанный без дефисов и пробелов.\n","\n","*Входные данные:*\n","\n","    8-900-123-45-67\n","\n","*Выходные данные:*\n","\n","    89001234567"]},{"cell_type":"code","source":["phone = input('Введите Ваш номер телефона через дефис: ').split(\"-\")\n","a = \"\".join(phone)\n","print(a)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"XEBmMpuMrfpV","outputId":"ec2d180d-d0c7-42b9-ea99-60d4eaaa479d","executionInfo":{"status":"ok","timestamp":1640856306853,"user_tz":-180,"elapsed":12312,"user":{"displayName":"Yulya Yulya","photoUrl":"https://lh3.googleusercontent.com/a/default-user=s64","userId":"13298818835018446364"}}},"execution_count":2,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите Ваш номер телефона через дефис: 8-912-713-07-19\n","89127130719\n"]}]},{"cell_type":"markdown","metadata":{"id":"WHTvpL_sjFPX"},"source":["### Задача 4\n","\n","Напишите программу, которая принимает на вход список L, в котором хранятся значения доходов домохозяйств за месяц, а возвращает новый список L2 ‒ список логарифмированных значений доходов."]},{"cell_type":"code","source":["import math\n","L = input(\"Введите доходы через пробел: \").split()\n","L2 = [math.log(int(i)) for i in L]\n","print(L2)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"C7EfVFDntbsH","outputId":"ea479ef1-2985-4c3e-ca29-5e60462ddb12"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["Введите доходы через пробел: 20000 15000 78965 100000 100\n","[9.903487552536127, 9.615805480084347, 11.276759995304156, 11.512925464970229, 4.605170185988092]\n"]}]},{"cell_type":"markdown","metadata":{"id":"WuBHccdMjFPX"},"source":["### Задача 5\n","\n","Напишите программу, которая принимает на вход список слов такого вида:\n","\n","    words = [\"Speak \",\"to\", \"me \", \"of\", \"Florence\" ,\"And \", \"of\", \"the\", \"Renaissance\"]\n","\n","а возвращает список\n","\n","    words_clean = [\"speak\", \"to\", \"me\", \"of\", \"florence\", \"and\", \"of\", \"the\", \"renaissance\"]\n","\n","Другими словами, программа убирает пробелы в словах и приводит все слова к нижнему регистру.\n","\n","**Подсказка:** запросите `help()`  по  методам `strip()` и `lower()`."]},{"cell_type":"code","source":["words = [\"Speak \",\"to\", \"me \", \"of\", \"Florence\" ,\"And \", \"of\", \"the\", \"Renaissance\"]\n","words_clean = [i.lower() for i in words]\n","print('words_clean =', words_clean)"],"metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"NjAFv7GOk_-A","outputId":"5ac36e3d-a920-4cb4-9ae5-fc8eedb1aa6a"},"execution_count":null,"outputs":[{"output_type":"stream","name":"stdout","text":["words_clean = ['speak ', 'to', 'me ', 'of', 'florence', 'and ', 'of', 'the', 'renaissance']\n"]}]}],"metadata":{"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.6.5"},"colab":{"name":"seminar3.ipynb","provenance":[],"collapsed_sections":[]}},"nbformat":4,"nbformat_minor":0}